# Biblioteka pandas
biblioteka do przetwarzania danych (napisana w Python, lecz ważne miejsca są napisane niskopoziomowo aby przyśpieszyć działanie).
Dostępna na githubie w [repo](https://github.com/pandas-dev/pandas). Służy do manipulacji danymi oraz ich analizy.
Nie jest uzywa się raczej w konfiguracjach rozproszonych - Spark.
Ale dobrze sprawdza się jako narzędzie do generowania danych na API np.
* Stworzenie listy klientów w pdf / excel wysłąnie takiego maila do klienta.
* Stworzenie raportu - historii/loga dla osób biznesowych
___

## Importowanie paczki pandas

In [2]:
import pandas as pd # zazwyczaj w kodach data sciensce choć nie musi tak być ;)

## Typy danych Pandas
* Serie
* DataFrame

In [3]:
from pandas import Series

In [32]:
seria = pd.Series([1, 2 , 3, 5, 8, 13, 21])

In [33]:
seria

0     1
1     2
2     3
3     5
4     8
5    13
6    21
dtype: int64

In [34]:
sum(seria)

53

In [28]:
pd.Series([1, 2 , 3, 5, 8, 13, 21]).sum()

53

In [8]:
seria

0     1
1     2
2     3
3     5
4     8
5    13
6    21
dtype: int64

In [9]:
seria = Series([400, 300, 200], index=['Poland', 'Germany', 'Spain'], name='Countries')

In [10]:
seria

Poland     400
Germany    300
Spain      200
Name: Countries, dtype: int64

In [193]:
import pandas as pd

In [18]:
miejscowosci = Series(['Wawa', 'Berlin', 'Madryt'], index=['Poland', 'Germany', 'Spain'])

In [19]:
miejscowosci

Poland       Wawa
Germany    Berlin
Spain      Madryt
dtype: object

In [20]:
xa = pd.concat([seria, miejscowosci], axis=1) # 1 jako kolumna dodaje

In [21]:
xa

         Countries       0
Poland         400    Wawa
Germany        300  Berlin
Spain          200  Madryt

In [22]:
xa.rename(columns={0:'stolice'}, inplace=True)

In [23]:
xa

         Countries stolice
Poland         400    Wawa
Germany        300  Berlin
Spain          200  Madryt

In [204]:
xa

         Countries       0
Poland         400    Wawa
Germany        300  Berlin
Spain          200  Madryt

In [24]:
ilosc = Series([0.18, 0.19, 0.20], index=['Poland', 'Germany', 'Spain'], name='Countries')

In [25]:
seria

Poland     400
Germany    300
Spain      200
Name: Countries, dtype: int64

In [26]:
ilosc

Poland     0.18
Germany    0.19
Spain      0.20
Name: Countries, dtype: float64

In [27]:
seria * ilosc

Poland     72.0
Germany    57.0
Spain      40.0
Name: Countries, dtype: float64

In [35]:
Series([True, True, False]).sum()

2

In [36]:
Series([True, True, False]).mean()

0.6666666666666666

In [37]:
Series([True, True, False, None, None]).sum()

2

In [14]:
Series([True, True, False, None, None, None]).mean()

0.6666666666666666

In [15]:
seria = Series([True, True, False, None, None, None])

In [38]:
seria.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [39]:
seria

0     1
1     2
2     3
3     5
4     8
5    13
6    21
dtype: int64

In [40]:
seria.isna()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [41]:
import numpy as np

In [42]:
seria = Series([1, 2, 3, np.NAN])

In [44]:
seria

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [43]:
seria.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [45]:
seria.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [46]:
seria.unique()

array([ 1.,  2.,  3., nan])

In [47]:
seria.nunique()

3

In [48]:
seria

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [49]:
seria.dropna(inplace=True)

In [50]:
seria

0    1.0
1    2.0
2    3.0
dtype: float64

In [51]:
from pandas import DataFrame

In [52]:
DataFrame(data={'a': ['val'], 'b': ['dal']})

     a    b
0  val  dal

In [53]:
seria

0    1.0
1    2.0
2    3.0
dtype: float64

In [54]:
DataFrame(data={'col1': seria, 'col2': seria})

   col1  col2
0   1.0   1.0
1   2.0   2.0
2   3.0   3.0

In [56]:
seria

0    1.0
1    2.0
2    3.0
dtype: float64

In [55]:
DataFrame(data={'col1': seria, 'col2': seria ** 2})

   col1  col2
0   1.0   1.0
1   2.0   4.0
2   3.0   9.0

In [57]:
seria = Series([np.NaN, np.inf, 0, 1, 2, None])

In [58]:
ramka = DataFrame(data={'col1': seria, 'col2': seria ** 2})

In [60]:
pd.na

NameError: name 'Nan' is not defined

In [61]:
ramka

       col1      col2
0       NaN       NaN
1       inf       inf
2  0.000000  0.000000
3  1.000000  1.000000
4  2.000000  4.000000
5       NaN       NaN

In [62]:
ramka['col3']  = Series([None, 1, None, -4])

In [63]:
ramka

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000  -4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [64]:
ramka = ramka.abs()

In [65]:
ramka.drop_duplicates()

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN

In [69]:
ramka.col1.sort_values()

2    0.000000
3    1.000000
4    2.000000
1         inf
0         NaN
5         NaN
Name: col1, dtype: float64

In [71]:
ramka

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [70]:
ramka.dropna()

       col1      col2  col3
1       inf       inf   1.0
3  1.000000  1.000000   4.0

In [72]:
ramka.dropna(subset=['col2'], how='all')

       col1      col2  col3
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN

In [75]:
ramka.dropna(subset=['col1', 'col3'], how='any')

       col1      col2  col3
1       inf       inf   1.0
3  1.000000  1.000000   4.0

In [66]:
ramka.dropna(how='all')

       col1      col2  col3
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000  -4.0
4  2.000000  4.000000   NaN

In [77]:
ramka.sort_values(['col1', 'col2'], ascending=False)

       col1      col2  col3
1       inf       inf   1.0
4  2.000000  4.000000   NaN
3  1.000000  1.000000   4.0
2  0.000000  0.000000   NaN
0       NaN       NaN   NaN
5       NaN       NaN   NaN

In [78]:
ramka.head(3)

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN

In [107]:
ramka.tail(2)

   col1  col2  col3
4   2.0   4.0   NaN
5   NaN   NaN   NaN

In [79]:
ramka.describe()

           col1      col2     col3
count  4.000000  4.000000  2.00000
mean        inf       inf  2.50000
std         NaN       NaN  2.12132
min    0.000000  0.000000  1.00000
25%    0.750000  0.750000  1.75000
50%    1.500000  2.500000  2.50000
75%         inf       inf  3.25000
max         inf       inf  4.00000

In [108]:
ramka.col3

0    NaN
1    1.0
2    NaN
3    4.0
4    NaN
5    NaN
Name: col3, dtype: float64

In [109]:
ramka.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [114]:
ramka

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [133]:
top = ramka.head(3)

In [134]:
type(top)

pandas.core.frame.DataFrame

In [122]:
ramka.drop(columns=['kolumna3'])

   kolumna1  kolumna2
0       NaN       NaN
1       inf       inf
2  0.000000  0.000000
3  1.000000  1.000000
4  2.000000  4.000000
5       NaN       NaN

In [84]:
ramka

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [85]:
ramka.fillna(0)

       col1      col2  col3
0  0.000000  0.000000   0.0
1       inf       inf   1.0
2  0.000000  0.000000   0.0
3  1.000000  1.000000   4.0
4  2.000000  4.000000   0.0
5  0.000000  0.000000   0.0

In [75]:
ramka.fillna({'col1': 0, 'col2': 3, 'col3': 4})

       col1      col2  col3
0  0.000000  3.000000   4.0
1       inf       inf   1.0
2  0.000000  0.000000   4.0
3  1.000000  1.000000  -4.0
4  2.000000  4.000000   4.0
5  0.000000  3.000000   4.0

In [77]:
ramka

       col1      col2  col3
0       NaN       NaN   NaN
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000  -4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [89]:
ramka.fillna({'col1': 0, 'col2': 3, 'col3': 4}, limit=1)

       col1      col2  col3
0  0.000000  3.000000   4.0
1       inf       inf   1.0
2  0.000000  0.000000   NaN
3  1.000000  1.000000   4.0
4  2.000000  4.000000   NaN
5       NaN       NaN   NaN

In [90]:
ramka_new = DataFrame(data=[ramka['col1'], ramka['col2'], ramka['col3'].fillna(666)])

In [115]:
ramka.rename(columns={'col1':'kolumna1', 'col2':'kolumna2', 'col3':'kolumna3'}, inplace=True)

In [116]:
ramka

   kolumna1  kolumna2  kolumna3
0       NaN       NaN       NaN
1       inf       inf       1.0
2  0.000000  0.000000       NaN
3  1.000000  1.000000       4.0
4  2.000000  4.000000       NaN
5       NaN       NaN       NaN

In [117]:
ramka['Imie'] = 'Tomek'

In [118]:
ramka

   kolumna1  kolumna2  kolumna3   Imie
0       NaN       NaN       NaN  Tomek
1       inf       inf       1.0  Tomek
2  0.000000  0.000000       NaN  Tomek
3  1.000000  1.000000       4.0  Tomek
4  2.000000  4.000000       NaN  Tomek
5       NaN       NaN       NaN  Tomek

In [120]:
ramka.filter(like='kol', axis=1)

   kolumna1  kolumna2  kolumna3
0       NaN       NaN       NaN
1       inf       inf       1.0
2  0.000000  0.000000       NaN
3  1.000000  1.000000       4.0
4  2.000000  4.000000       NaN
5       NaN       NaN       NaN

In [122]:
ramka.filter(like='2', axis=0)

   kolumna1  kolumna2  kolumna3   Imie
2       0.0       0.0       NaN  Tomek

In [ ]:
ramka.filter(like='0', axis=0)

In [125]:
ramka

   kolumna1  kolumna2  kolumna3   Imie
0       NaN       NaN       NaN  Tomek
1       inf       inf       1.0  Tomek
2  0.000000  0.000000       NaN  Tomek
3  1.000000  1.000000       4.0  Tomek
4  2.000000  4.000000       NaN  Tomek
5       NaN       NaN       NaN  Tomek

In [124]:
ramka.filter(regex='^[23]', axis=0)

   kolumna1  kolumna2  kolumna3   Imie
2       0.0       0.0       NaN  Tomek
3       1.0       1.0       4.0  Tomek

In [126]:
ramka.index

RangeIndex(start=0, stop=6, step=1)

## Czytanie plików excel
W przypadku plików excel istnieje problem z odczytywaniem ich (różne formaty). Microsoft raczej stara się bronić swoich rozwiązań. Wystarczy porównać sposób odczytu plików przez Word a rozwiązania Open Source tj. LibreOffice

In [ ]:
df_excel = pd.read_excel('plik_excel.xls')

## Exploracyjna analiza danych - podstawy zbierania danych
Aby zorientować się z jakimi danymi mamy doczynia, musimy podejrzeć dane. Możemy przyjąć różny sposób postępowania.
Taka analiza danych występuje przed predykcyjną analizą danych.
Najpierw musimy zrozumieć co robimy dopiero "przewidujemy przyszłość"

In [ ]:
# Wyswietl nagłówek danych
print(df.head())

# Wyświetl "ogon" danych
print(df.tail())

# Wyświetl wymiary
print(df.shape)

# Wyświetl kolumny DataFrame
print(df.columns)

print(df.info())

### Podsumowanie dla danych kolumn
Wygodniej jest użyć gotowej funkcji. Niż dla każdej kolumny robić osobne obliczenia.

In [ ]:
df.info()

In [ ]:
print(df['State'].value_counts(dropna=False))

In [ ]:
print(df['State'].value_counts(dropna=False, normalize=True))

In [ ]:
print(df['State'].unique())

In [ ]:
print(df['State'].nunique())

### Selekcja danych

#### Po wierszach

In [ ]:
ndarray[row]

#### Slicing

In [ ]:
ndarray[0:5,6:]

#### Lista wartości

In [ ]:
ndarray[[0,1,3,4],0]

### Wizualizacja danych
Czasem ułatwia to zrozumienie danych. Szczególnie bardziej wizualnym lub biznesowym osobom.

### Plot

In [ ]:
# Import matplotlib.pyplot
import matplotlib.pyplot as plt

# Plot the histogram
df['Existing Zoning Sqft'].plot(kind='hist', rot=70, logx=True, logy=True)

# Display the histogram
plt.show()

* Czy widać podobieństwo rozkład a histogram ?

In [ ]:
# Import necessary modules
import pandas as pd
import matplotlib.pyplot as plt

# Create the boxplot
df.boxplot(column='initial_cost', by='Borough', rot=90)

# Display the plot
plt.show()

### Scatter plot
Przydatne gdy chcemy zwizualizować zależności między dwoma zmiennymi np.
* Im osoba jest wyższa tym będzie więcej ważyć,
* Im silnik ma większą pojemność tym więcej bedzie spalał paliwa,
* Im więcej człowiek zarabia tym prawdopodobnie więcej wydaje (poziom życia się podnosi)

In [ ]:
# Create and display the first scatter plot
df.plot(kind='scatter', x='initial_cost', y='total_est_fee', rot=70)
plt.show()

# Create and display the second scatter plot
df_subset.plot(kind='scatter', x='initial_cost', y='total_est_fee', rot=70)
plt.show()

### DataFrame

In [99]:
Series([1, 2], dtype='object')

0    1
1    2
dtype: object

In [104]:
x = Series([1.2, 2.1], dtype='int32')

In [105]:
x * 2

0    2
1    4
dtype: int32

In [107]:
Series([1.2, 2.1], dtype='str')

0    1.2
1    2.1
dtype: object

In [111]:
x = Series([1.2, 2.1], dtype='object')

In [112]:
z = Series([1.2, 2.1], dtype='str')

#### Konwertowanie typów danych

In [ ]:
tips.sex.describe()

In [ ]:
# Convert the sex column to type 'category'
tips.sex = tips.sex.astype('category')

# Convert the smoker column to type 'category'
tips.smoker = tips.smoker.astype('category')

# Print the info of tips
print(tips.info()

#### Konwersja numeryczna

In [ ]:
# Convert 'total_bill' to a numeric dtype
tips['total_bill'] = pd.to_numeric(tips['total_bill'], errors='coerce')

# Convert 'tip' to a numeric dtype
tips['tip'] = pd.to_numeric(tips['tip'], errors='coerce')

# Print the info of tips
print(tips.info())

In [ ]:
import re

# Compile the pattern: prog
prog = re.compile('\d{3}-\d{3}-\d{4}')

# See if the pattern matches
result = prog.match('123-456-7890')
print(bool(result))

# See if the pattern matches
result = prog.match('1123-456-7890')
print(bool(result))

In [ ]:

## Merge
TODO:
    
# Merge the DataFrames: o2o
o2o = pd.merge(left=site, right=visited, left_on='name', right_on='site')

In [ ]:
## Joins
TODO:

## Melt
Melt airquality: airquality_melt
airquality_melt = pd.melt(airquality, id_vars=['Month', 'Day'])

In [ ]:
## Pivot - czyoli unmelting

## Oczyszcanie kolumn

In [ ]:
tb_melt.variable.str[0:]

# Create the 'str_split' column
ebola_melt['str_split'] = ebola_melt['type_country'].str.split('_')

# Create the 'type' column
ebola_melt['type'] = ebola_melt['str_split'].str.get(0)

# Create the 'country' column
ebola_melt['country'] = ebola_melt['str_split'].str.get(1)

In [ ]:
### Konkantenacja

#### Oczyszczanie przy użyciu funkcji

In [ ]:
# Define recode_sex()
def recode_sex(sex_value):

    # Return 1 if sex_value is 'Male'
    if sex_value == 'Male':
        return 1
    elif sex_value == 'Female':
        return 0
    else:
        return np.nan

# Apply the function to the sex column
tips['sex_recode'] = tips.sex.apply(recode_sex)

#### Oczyszczenie przy użyciu Lambdy

In [ ]:
# Write the lambda function using replace
tips['total_dollar_replace'] = tips.total_dollar.apply(lambda x: x.replace('$', ''))

# Write the lambda function using regular expressions
tips['total_dollar_re'] = tips.total_dollar.apply(lambda x: re.findall('\d+\.\d+', x)[0])

## Imputacja

### Imputacja przy użyciu średniej

In [ ]:
# Calculate the mean of the Ozone column: oz_mean
oz_mean = airquality.Ozone.mean()

# Replace all the missing values in the Ozone column with the mean
airquality['Ozone'] = airquality.Ozone.fillna(oz_mean)

# Print the info of airquality
print(airquality.info())

## Sprawdzanie danych

In [ ]:
# Assert that country does not contain any missing values
assert pd.notnull(gapminder.country).all()

# Assert that year does not contain any missing values
assert pd.notnull(gapminder.year).all()

# Drop the missing values
gapminder = gapminder.dropna()

# Print the shape of gapminder
print(gapminder.shape)